from langchain_community.llms import LlamaCpp

llm = LlamaCpp(
    model_path=r"D:\\mol\\rag_system\\models\\gpt-oss-20b-Q4_K_M.gguf",
    # model_path=r"D:\\mol\\rag_system\\models\\qwen2.5-7b-instruct-q4_k_m.gguf",
    n_ctx=4096,
    n_threads=16,
    temperature=0.0,
    max_tokens=300,
    repeat_penalty=1.0,
    # top_p=0.95,
    # top_k=40,
    # n_gpu_layers=-1,  # -1 moves all layers to GPU; 0 is CPU-only
    verbose=True,
)

prompt = """Извлеки только ответ на вопрос. 
Никаких пояснений, цифр, символов или форматирования.

Контекст:
 5 Средства измерений 5.1 Шумомеры и персональные дозиметры шума Измерения шума на рабочем месте выполняют с помощью интегрирующих-усредняющих шумо- меров или персональных дозиметров шума. Шумомер вместе с микрофоном и соединительными кабелями должен удовлетворять требованиям к средствам измерений класса 1 или 2 по IEC 61672-1. Шумомеры класса 1 предпочтительны. Персональный дозиметр шума вместе с микрофоном и соединительным кабелем должен удовлетворять требованиям IEC 61252. Если измерения проводят в условиях очень низких температур или в шуме доминируют высокочастотные составляющие, то персональный дозиметр шума должен удовлетворять требованиям к шумомерам класса 1 по IEC 61672-1 (см. примечание 2). П р и м е ч а н и е 1  — Для средств измерений класса 1 по IEC 61672-1 установлен диапазон допустимых температур от минус 10 °С до плюс 50 °С, в то время как для шумомеров класса 2 по IEC 61672-1 и персональных дозиметров шума по IEC 61252 метрологические характеристики определены для температур окружающего воздуха от 0 °С до плюс 40 °С. Чтобы обеспечить необходимую точность измерений в условиях, когда температура воздуха находится вне пределов указанного диапазона, следует использовать средства измерений, для которых такая возможность указана изготовителем, или же воспользоваться шумомерами класса 1 по IEC 61672-1. П р и м е ч а н и е 2  — От выбора средства измерений зависит неопределенность измерения. П р и м е ч а н и е З  — IEC 61252 предусматривает широкие пределы допуска для частотной характеристики прибора на частотах свыше 4000 Гц, что может привести к ошибочным результатам измерений при наличии в измеряемом шуме высокочастотных составляющих, подобных создаваемым воздушным соплом. Чтобы уменьшить инструментальную составляющую неопределенности при измерениях такого шума, может оказаться необходимым использовать средство измерений, для которого изготовитель указал более узкий диапазон допуска на высоких частотах, или же воспользоваться шумомерами класса 1 по IEC 61672-1. Нижняя граница диапазона измерений персонального дозиметра шума может быть высока. Следует убедиться, что это не оказывает влияния на результат измерения. 5.2 Акустический калибратор Акустический калибратор должен удовлетворять требованиям к средствам измерений класса 1 по IEC 60942. Допускается использовать калибраторы класса 2 по IEC 60942, если такая возможность предусмотрена изготовителем шумомера или дозиметра. При этом применяемый калибратор должен соответствовать типу, указанному производителем шумомера или дозиметра. 5.3 Подтверждение метрологических характеристик Для обеспечения прослеживаемости результатов измерений к национальным эталонам следует регулярно проводить поверку акустического калибратора и подтверждать соответствие средств измерений шума требованиям IEC 61672-1, IEC 61252 и других соответствующих стандартов силами специализированной лаборатории. Применяемые средства измерений должны иметь действующие свидетельства о поверке. Срок действия свидетельства о поверке и наименование выдавшей его лаборатории следует указывать в протоколе измерений.

Вопрос:
Какие средства измерения мне подготовить для определения уровня шума по ГОСТ 9612?

Краткий точный ответ:"""
# output = llm(
#       prompt=prompt,
#       max_tokens=300,
# )
output = llm.invoke(prompt)

print(output)
